// Generated by jextract

package org.jetbrains.desktop.macos.generated;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct MouseUpEvent {
 *     WindowId window_id;
 *     MouseButton button;
 *     struct LogicalPoint location_in_window;
 *     struct LogicalPoint location_in_screen;
 *     MouseButtonsSet pressed_buttons;
 * }
 * }
 */
public class MouseUpEvent {

    MouseUpEvent() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        desktop_macos_h.C_LONG_LONG.withName("window_id"),
        desktop_macos_h.C_INT.withName("button"),
        MemoryLayout.paddingLayout(4),
        LogicalPoint.layout().withName("location_in_window"),
        LogicalPoint.layout().withName("location_in_screen"),
        desktop_macos_h.C_INT.withName("pressed_buttons"),
        MemoryLayout.paddingLayout(4)
    ).withName("MouseUpEvent");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong window_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("window_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WindowId window_id
     * }
     */
    public static final OfLong window_id$layout() {
        return window_id$LAYOUT;
    }

    private static final long window_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WindowId window_id
     * }
     */
    public static final long window_id$offset() {
        return window_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WindowId window_id
     * }
     */
    public static long window_id(MemorySegment struct) {
        return struct.get(window_id$LAYOUT, window_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WindowId window_id
     * }
     */
    public static void window_id(MemorySegment struct, long fieldValue) {
        struct.set(window_id$LAYOUT, window_id$OFFSET, fieldValue);
    }

    private static final OfInt button$LAYOUT = (OfInt)$LAYOUT.select(groupElement("button"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * MouseButton button
     * }
     */
    public static final OfInt button$layout() {
        return button$LAYOUT;
    }

    private static final long button$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * MouseButton button
     * }
     */
    public static final long button$offset() {
        return button$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * MouseButton button
     * }
     */
    public static int button(MemorySegment struct) {
        return struct.get(button$LAYOUT, button$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * MouseButton button
     * }
     */
    public static void button(MemorySegment struct, int fieldValue) {
        struct.set(button$LAYOUT, button$OFFSET, fieldValue);
    }

    private static final GroupLayout location_in_window$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("location_in_window"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct LogicalPoint location_in_window
     * }
     */
    public static final GroupLayout location_in_window$layout() {
        return location_in_window$LAYOUT;
    }

    private static final long location_in_window$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct LogicalPoint location_in_window
     * }
     */
    public static final long location_in_window$offset() {
        return location_in_window$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct LogicalPoint location_in_window
     * }
     */
    public static MemorySegment location_in_window(MemorySegment struct) {
        return struct.asSlice(location_in_window$OFFSET, location_in_window$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct LogicalPoint location_in_window
     * }
     */
    public static void location_in_window(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, location_in_window$OFFSET, location_in_window$LAYOUT.byteSize());
    }

    private static final GroupLayout location_in_screen$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("location_in_screen"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct LogicalPoint location_in_screen
     * }
     */
    public static final GroupLayout location_in_screen$layout() {
        return location_in_screen$LAYOUT;
    }

    private static final long location_in_screen$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct LogicalPoint location_in_screen
     * }
     */
    public static final long location_in_screen$offset() {
        return location_in_screen$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct LogicalPoint location_in_screen
     * }
     */
    public static MemorySegment location_in_screen(MemorySegment struct) {
        return struct.asSlice(location_in_screen$OFFSET, location_in_screen$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct LogicalPoint location_in_screen
     * }
     */
    public static void location_in_screen(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, location_in_screen$OFFSET, location_in_screen$LAYOUT.byteSize());
    }

    private static final OfInt pressed_buttons$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pressed_buttons"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * MouseButtonsSet pressed_buttons
     * }
     */
    public static final OfInt pressed_buttons$layout() {
        return pressed_buttons$LAYOUT;
    }

    private static final long pressed_buttons$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * MouseButtonsSet pressed_buttons
     * }
     */
    public static final long pressed_buttons$offset() {
        return pressed_buttons$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * MouseButtonsSet pressed_buttons
     * }
     */
    public static int pressed_buttons(MemorySegment struct) {
        return struct.get(pressed_buttons$LAYOUT, pressed_buttons$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * MouseButtonsSet pressed_buttons
     * }
     */
    public static void pressed_buttons(MemorySegment struct, int fieldValue) {
        struct.set(pressed_buttons$LAYOUT, pressed_buttons$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

