// Generated by jextract

package org.jetbrains.kwm.macos.generated;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct KeyDownEvent {
 *     WindowId window_id;
 *     enum KeyCode code;
 *     StrPtr characters;
 *     StrPtr key;
 *     bool is_repeat;
 * }
 * }
 */
public class KeyDownEvent {

    KeyDownEvent() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        kwm_macos_h.C_LONG_LONG.withName("window_id"),
        kwm_macos_h.C_INT.withName("code"),
        MemoryLayout.paddingLayout(4),
        kwm_macos_h.C_POINTER.withName("characters"),
        kwm_macos_h.C_POINTER.withName("key"),
        kwm_macos_h.C_BOOL.withName("is_repeat"),
        MemoryLayout.paddingLayout(7)
    ).withName("KeyDownEvent");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong window_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("window_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WindowId window_id
     * }
     */
    public static final OfLong window_id$layout() {
        return window_id$LAYOUT;
    }

    private static final long window_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WindowId window_id
     * }
     */
    public static final long window_id$offset() {
        return window_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WindowId window_id
     * }
     */
    public static long window_id(MemorySegment struct) {
        return struct.get(window_id$LAYOUT, window_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WindowId window_id
     * }
     */
    public static void window_id(MemorySegment struct, long fieldValue) {
        struct.set(window_id$LAYOUT, window_id$OFFSET, fieldValue);
    }

    private static final OfInt code$LAYOUT = (OfInt)$LAYOUT.select(groupElement("code"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum KeyCode code
     * }
     */
    public static final OfInt code$layout() {
        return code$LAYOUT;
    }

    private static final long code$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum KeyCode code
     * }
     */
    public static final long code$offset() {
        return code$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum KeyCode code
     * }
     */
    public static int code(MemorySegment struct) {
        return struct.get(code$LAYOUT, code$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum KeyCode code
     * }
     */
    public static void code(MemorySegment struct, int fieldValue) {
        struct.set(code$LAYOUT, code$OFFSET, fieldValue);
    }

    private static final AddressLayout characters$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("characters"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * StrPtr characters
     * }
     */
    public static final AddressLayout characters$layout() {
        return characters$LAYOUT;
    }

    private static final long characters$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * StrPtr characters
     * }
     */
    public static final long characters$offset() {
        return characters$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * StrPtr characters
     * }
     */
    public static MemorySegment characters(MemorySegment struct) {
        return struct.get(characters$LAYOUT, characters$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * StrPtr characters
     * }
     */
    public static void characters(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(characters$LAYOUT, characters$OFFSET, fieldValue);
    }

    private static final AddressLayout key$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("key"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * StrPtr key
     * }
     */
    public static final AddressLayout key$layout() {
        return key$LAYOUT;
    }

    private static final long key$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * StrPtr key
     * }
     */
    public static final long key$offset() {
        return key$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * StrPtr key
     * }
     */
    public static MemorySegment key(MemorySegment struct) {
        return struct.get(key$LAYOUT, key$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * StrPtr key
     * }
     */
    public static void key(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(key$LAYOUT, key$OFFSET, fieldValue);
    }

    private static final OfBoolean is_repeat$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("is_repeat"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool is_repeat
     * }
     */
    public static final OfBoolean is_repeat$layout() {
        return is_repeat$LAYOUT;
    }

    private static final long is_repeat$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool is_repeat
     * }
     */
    public static final long is_repeat$offset() {
        return is_repeat$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool is_repeat
     * }
     */
    public static boolean is_repeat(MemorySegment struct) {
        return struct.get(is_repeat$LAYOUT, is_repeat$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool is_repeat
     * }
     */
    public static void is_repeat(MemorySegment struct, boolean fieldValue) {
        struct.set(is_repeat$LAYOUT, is_repeat$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

